{
  "cars": [
    {
      "carType": "Sedan",
      "brand": "Toyota",
      "carModel": "Corolla",
      "image": "../assets/sedan.png",
      "yearOfManufacture": 2014,
      "mileage": "48157 km",
      "fuelType": "Hybrid",
      "available": true,
      "inStore": 4,
      "pricePerDay": 109,
      "description": "A sleek and efficient 2014 Toyota Corolla Hybrid, perfect for city driving and long-distance comfort. With a modern aerodynamic design, exceptional fuel economy, and a spacious interior, this sedan offers reliability and performance with low mileage. Ideal for those seeking a balance of style, efficiency, and everyday practicality.",
      "vin": "cQ059872OBnC49727"
    },
    {
      "carType": "SUV",
      "brand": "Honda",
      "carModel": "Civic",
      "image": "../assets/suv.png",
      "yearOfManufacture": 2013,
      "mileage": "21980 km",
      "fuelType": "Diesel",
      "available": true,
      "inStore": 9,
      "pricePerDay": 130,
      "description": "A compact yet powerful 2013 Honda Civic SUV with a reliable diesel engine and low mileage. Designed for efficiency and urban versatility, it offers a smooth ride, spacious cabin, and excellent fuel economy. Ideal for drivers who value performance, practicality, and a refined driving experience in a compact SUV package.",
      "vin": "Ql927183bjYZ76357"
    },
    {
      "carType": "Sedan",
      "brand": "Chevrolet",
      "carModel": "Impala",
      "image": "../assets/sedan2.png",
      "yearOfManufacture": 2022,
      "mileage": "16089 km",
      "fuelType": "Gasoline",
      "available": true,
      "inStore": 10,
      "pricePerDay": 46,
      "description": "Experience modern elegance with the 2022 Chevrolet Impala — a full-size sedan that blends comfort, performance, and affordability. With just 16,089 km on the odometer, this gasoline-powered Impala offers a smooth, quiet ride, a spacious interior, and advanced safety features, making it an excellent choice for families and professionals alike.",
      "vin": "iz580420HnSf80218"
    },
    {
      "carType": "Coupe",
      "brand": "Chevrolet",
      "carModel": "Malibu",
      "image": "../assets/coupe.png",
      "yearOfManufacture": 2007,
      "mileage": "80295 km",
      "fuelType": "Hybrid",
      "available": false,
      "inStore": 0,
      "pricePerDay": 55,
      "description": "A dependable hybrid coupe with a legacy of reliability, the 2007 Chevrolet Malibu offers practicality and solid performance. With 80,295 km driven, this model features a hybrid powertrain designed to reduce fuel consumption while maintaining comfort and control. Though currently unavailable, it remains a popular choice among value-focused drivers seeking efficient transportation.",
      "vin": "He489064ZbKn43058"
    },
    {
      "carType": "Wagon",
      "brand": "BMW",
      "carModel": "X3",
      "image": "../assets/wagon.png",
      "yearOfManufacture": 2016,
      "mileage": "14808 km",
      "fuelType": "Diesel",
      "available": true,
      "inStore": 7,
      "pricePerDay": 120,
      "description": "A premium diesel-powered 2016 BMW X3, offering the perfect blend of luxury, practicality, and performance. With just 14,808 km on the clock, this versatile wagon delivers a smooth and responsive driving experience, spacious interior comfort, and refined German engineering — ideal for both city commuting and long-distance touring.",
      "vin": "Ep746023iTVz17689"
    },
    {
      "carType": "SUV",
      "brand": "BMW",
      "carModel": "X5",
      "image": "../assets/suv2.png",
      "yearOfManufacture": 2013,
      "mileage": "12316 km",
      "fuelType": "Gasoline",
      "available": false,
      "inStore": 0,
      "pricePerDay": 49,
      "description": "The 2013 BMW X5 is a refined midsize SUV that combines luxury, performance, and versatility. With only 12,316 km on the odometer, this gasoline-powered model offers smooth handling, spacious comfort, and premium features. Though currently unavailable, it remains a sought-after option for drivers who appreciate German engineering and elegant design.",
      "vin": "Md394582yqGX68302"
    }
  ]
}
